tap "homebrew/cask"
brew "git"
brew "gh"
brew "stow"
brew "lazygit"
brew "go"
brew "pyenv"
brew "neovim"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "kubectl"
brew "kubectx"
brew "k9s"
cask "firefox"
cask "alacritty"
