tap "fluxcd/tap"
tap "hashicorp/tap"

# core
brew "git"
brew "git-lfs"
brew "stow"
brew "make"
brew "coreutils"
brew "curl"
brew "wget"
brew "unzip"
brew "zip"
brew "grep"
brew "fd"
brew "fzf"
brew "ripgrep"
brew "jq"
brew "just"
brew "pwgen"

# shell
brew "starship"
brew "sheldon"
brew "tmux"

# runtime manager (bootstraps mise-managed tools)
brew "mise"

# cloud + infra
brew "gh"
brew "bitwarden-cli"
brew "helm"
brew "k9s"
brew "kubectx"
brew "kubernetes-cli"
brew "kustomize"
brew "oci-cli"
brew "socat"
brew "argocd"
brew "fluxcd/tap/flux"
brew "hashicorp/tap/hcp"
brew "hashicorp/tap/vault"

# dev tools
brew "lazygit"
brew "neovim"
brew "protobuf"
brew "gnupg"
brew "lua-language-server"
brew "luajit"
brew "kotlin"

# casks
cask "claude-code"
cask "docker-desktop"
cask "firefox"
cask "ghostty"

# vscode extensions
vscode "beardedbear.beardedtheme"
vscode "pkief.material-icon-theme"
vscode "golang.go"
vscode "ms-python.python"
vscode "ms-python.debugpy"
vscode "ms-python.black-formatter"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "hashicorp.terraform"
vscode "ms-azuretools.vscode-azureterraform"
vscode "ms-azuretools.vscode-bicep"
vscode "ms-azuretools.azure-dev"
vscode "ms-azuretools.vscode-docker"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azureappservice"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azurecontainerapps"
vscode "ms-azuretools.vscode-azurestaticwebapps"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-azurevirtualmachines"
vscode "ms-azuretools.vscode-cosmosdb"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.azurecli"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-playwright.playwright"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "redhat.vscode-yaml"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "hediet.vscode-drawio"
vscode "postman.postman-for-vscode"
vscode "paiqo.databricks-vscode"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.makefile-tools"
vscode "pomdtr.excalidraw-editor"
